// todo:       Module no -8.3      topic: If else statement (visualization)

/**
 * ধরুন আপনি একটা মেলায় গেলেন । সেখানে দুইটা গেইট আছে, প্রথম গেইটের মেনেজার আপনায় বলল , আপনি যদি ১০ বছরের বেশি হন তবে মেলায় ঢুক্তে পারবেন ঃ */

let age = 12;
let parent = 25;

if(age > 10){
    console.log('আপনি মেলায় ঢুকেতে পারবেন ।');
}else{
    console.log('আপনি মেলায় ঢুকতে পারবেন না। ');
}

// দ্বিতীয় গেইটের ম্যানেজার এর কাছে গেলেন ঃ তিনি বলল যে, আপার বয়স যদি , ১৮ হয় তাহলে আপনি , সবগুলো রাইডেই উঠতে পারবেন নাহলে, সবগুলো রাইডেই উঠতে পারবেন না। 

 if(age >= 18){
    console.log('সবগুলো রাইডেই উঠতে পারবেন');
 }else if(age>= 16){
    console.log('আপনি ৩ টা রেইডে উঠতে পারবেন');
 }else{
    console.log('আপনি শুধু বাচ্চাদের গাড়িতে উঠতে পারবেন ');
 }


 // vut banglo:
 

 if( age > 10){
    console.log('আপনি মেলায় ঢুকেতে পারবেন ');

    if(parent >= 20){
        console.log('ভুত বাংলোতে ঢুকেতে পারবেন  ');
    }
 }else if (parent <= 20){
                console.log('ভুত বাংলোতে ঢুকেতে পারবেন না ');

 }
 else{
    console.log('আপনি মেলায় ঢুকতে পারবেন না। ');

 }
